const html = `<p><img src="http://testing.dfw.ftp.lmops.com:10080/east/release/EC5KUILC1610420040915/1610420040915_test_wm.png" hash="ba88d9f77d6f4f6873391fb046c58873c9e393c3166b0b4f90ac465243de21b6" alt="手机屏幕截图

描述已自动生成" /></p><p><strong>英国首都伦敦宣布进入疫情“重大事故”状态</strong></p><p>据中新社，英国伦敦市长萨迪克汗当地时间8日宣布，由于连日来伦敦新冠病毒感染病例剧增，各大医院已经不堪重负，首都伦敦已进入“重大事故”状态。</p><p>萨迪克汗当日在推特上发文，“因为我们城市已经陷入疫情危机，今天我宣布伦敦进入‘重大事故’应急状态”。“现在，每30个伦敦人中就有1人感染了新冠病毒，在伦敦某些地区，这个数字高达20比1。”萨迪克汗表示，目前全伦敦有7000多住院的新冠病人，比去年3至4月第一波高峰还增加了35%。“如果我们现在不立即采取行动，我们英国国家医疗服务体系(NHS)可能会不堪重负，更多的人将会面临死亡的威胁”。</p><p>日前，伦敦救护服务热线每天紧急电话数量多达8000多个，而在平常最繁忙时一天约5500个左右。NHS英格兰地区首席执行官西蒙·史蒂文斯(Simon Stevens)在新闻发布会上警告称，每天都有800多名新冠病毒患者被送入伦敦的医院。</p><p><strong>美国日增新冠确诊近30万例</strong> </p><p>据新华社，美国疾病控制和预防中心7日公布的最新疫情数据显示，6日全美报告新增新冠确诊病例近30万例，刷新疫情暴发以来最高纪录；新增死亡病例超过3800例。</p><p>美国《大西洋月刊》发起的追踪全美疫情项目最新数据显示，截至6日，全美新冠住院患者总数达132476人，再次刷新疫情暴发以来最高纪录。</p><p>美国养老院等长期护理机构一直是疫情“重灾区”。项目数据显示，截至去年12月底，全美长期护理机构报告的新冠确诊病例累计已超过100万例；去年12月是该项目统计长期护理机构相关数据以来新冠死亡病例最多的一个月。</p><p>尽管美国多项疫情数据刷新纪录，但该项目指出，受圣诞和新年假期数据统计滞后影响，目前的数据可能还未完全反映疫情真实状况。一些公共卫生专家此前预测，美国新年假期之后，新冠发病率、病亡率等可能大幅上升。</p><p><strong>世卫组织：疫情防控不能因有了疫苗而松懈</strong></p><p>当地时间8日下午，北京时间今天（1月9日）凌晨，世界卫生组织在日内瓦举行新冠肺炎疫情例行发布会。世卫组织总干事谭德塞表示，现在仍处于疫情危险时刻，各国不能因为新冠疫苗开始推出而大意自满，导致疫情防控松懈。</p><p>谭德塞说，在疫情严重地区，避免室内聚集尤为重要，如果必须与他人碰面，应采取预防措施，并尽可能地在室外。打破的病毒传播链越多，就越能避免重症和死亡病例。<br /><br />世卫组织卫生紧急项目负责人迈克尔·瑞安表示，新冠病毒的传播正在加剧，很难预测实际有多少人已感染过病毒，但全球多达四分之三的人口仍然属于易感人群。</p><p><strong>再次确认！新冠疫苗，全民免费接种</strong></p><p>新冠疫苗全民免费接种。国务院联防联控机制再次在发布会上确认了这一消息。</p><p>国家卫生健康委员会副主任、国务院联防联控机制科研攻关组疫苗研发专班负责人曾益新表示，习近平总书记要求我们始终牢记人民至上的理念，要把人民的健康摆在优先的战略位置。在新冠疫苗的接种过程中，我们一定要深刻理解和贯彻这个理念。免费是包括了疫苗的费用和接种费用，不是指政府光承担接种的费用，包括了疫苗费用和接种费用。</p><p>在重点人群接种过程中，我们也曾经发现有个别地方收取个人费用的情况，我们以国务院联防联控机制综合组的名义发文，要求立即整改。目前看来，各地对执行免费接种政策都做得挺好，很到位。这是重点人群接种阶段免费接种的安排。</p><p><strong>湖北：未现明显拐点，石家庄隔离一万多人、累计阳性354人……</strong></p><p>1月9日，河北省新冠肺炎疫情防控工作第2场新闻发布会。发布会通报，从1月6日凌晨，石家庄市对全体市民进行了全员的核酸检测，到昨天晚上12时检测全部结束，并且有了结果。检测的对象一共是10251875人，累计检出阳性人员354人。</p><p>截至今天早晨8点，石家庄全市已集中隔离11708人，启用隔离场所120个。</p><p>河北省卫生健康委员会党组成员、副主任段云波表示，1月9日0—10时，河北新增2例新冠肺炎确诊病例。从1月2日报告本土首例病例到今天上午10点，已经有确诊病例139例，其中重症是7例，所有重症病例年龄偏大，最大的89岁，而且均有高血压、冠心病、糖尿病等基础疾病；儿童病例有5例，最小3岁。无症状感染者一共197例，最大年龄91岁，其中儿童40例，最小1岁。</p><p>相关负责人表示，本次疫情还没有看到明显的拐点，尽管这两天有的时候新增的阳性病例确诊病例出现了下降，但是据专家们判断，还不能确定现在已经出现了拐点。另外溯源工作还在进行，病情蔓延的状态还没有萎缩的趋势，扩散的风险依然存在。</p><p><img src="http://testing.dfw.ftp.lmops.com:10080/east/release/6NDS7EQS1610420041594/1610420041593_test_wm.png" hash="16692cb5bd6ae43f6bf7c9577f4c694d77f1f27bde1b315a0e595c05d6000e9f" alt="图表

描述已自动生成" /></p>`
// let d = html.replace(/(\n|\r|(\r\n)|(\u0085)|(\u2028)|(\u2029))/g, "")
// let arr = d.match(/\<img.*?\_wm.*?\/>/g)
// console.log(addWatermarkText(d))
// console.log(arr)
// console.log(d)



const watermarkTemplate = (time, hash, br) => {
  let html = `<p style="font-size: 12px;color: #999999;" del contenteditable="false">此图片已进行暗水印原创保护 水印生成时间：${1}<br></p><p style="font-size: 12px;color: #999999;" del contenteditable="false">图片hash：${hash || ''
    }</p>`
  if (br) {
    html = html + '<p><br></p>'
  }
  return html
}

const addWatermarkText = (html, br = true) => {
  html = html.replace(/(\n|\r|(\r\n)|(\u0085)|(\u2028)|(\u2029))/g, "")
  let arr = html.match(/\<img.*?\_wm.*?\/>/g)
  console.log(arr)
  if (arr) {
    for (let item of arr) {
      let time = item.match(/(\d{13})\_.*?\_wm/)
      let hash = item.match(/_wm.*?hash="(.*?)"/)
      let text = watermarkTemplate(time[1], hash[1], br)
      html = html.replace(item, `${item}${text}`)
    }
  }
  return html
}

console.log(addWatermarkText(html))